##  Replace Employee ID With The Unique Identifier Leetcode Task27

In [56]:
import pandas as pd
import numpy as np

In [57]:
data = [[1, 'Alice'], [7, 'Bob'], [11, 'Meir'], [90, 'Winston'], [3, 'Jonathan']]
Employees = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'int64', 'name':'object'})
data = [[3, 1], [11, 2], [90, 3]]
EmployeeUNI = pd.DataFrame(data, columns=['id', 'unique_id']).astype({'id':'int64', 'unique_id':'int64'})

In [58]:
Employees

   id      name
0   1     Alice
1   7       Bob
2  11      Meir
3  90   Winston
4   3  Jonathan

In [59]:
EmployeeUNI

   id  unique_id
0   3          1
1  11          2
2  90          3

In [62]:
df=Employees.merge(EmployeeUNI,on='id' , how='left')
df[['unique_id','name']]

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan